week06/presentation.html


<div id="outline-container-org73fb976" class="outline-4">
<h4 id="org73fb976"><span class="section-number-4">1.5.2</span> Struct Intro</h4>
<div class="outline-text-4" id="text-1-5-2">
<p>
How do you store a record?
</p>

<p>
In python you typically use a dictionary and store key value pairs
within a dictionary.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">my_pet</span> = {<span style="color: #8b2252;">"name"</span>:<span style="color: #8b2252;">"Dan"</span>, <span style="color: #8b2252;">"type"</span>:<span style="color: #8b2252;">"dog"</span>, <span style="color: #8b2252;">"age"</span>:6 }
</pre>
</div>

<p>
In C structures allow you to group relevant information together such
that you can access fields (properties).
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">NAME_LEN</span> 17
<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">TYPE_LEN</span> 9
<span style="color: #a020f0;">struct</span> {
    <span style="color: #228b22;">char</span> <span style="color: #a0522d;">name</span>[NAME_LEN];
    <span style="color: #228b22;">char</span> <span style="color: #a0522d;">type</span>[TYPE_LEN];
    <span style="color: #228b22;">int</span>  <span style="color: #a0522d;">age</span>;
} <span style="color: #a0522d;">my_pet</span>;
</pre>
</div>

<p>
In python you access the dictionary or object with:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">my_pet</span> = {<span style="color: #8b2252;">"name"</span>:<span style="color: #8b2252;">"Dan"</span>, <span style="color: #8b2252;">"type"</span>:<span style="color: #8b2252;">"dog"</span>, <span style="color: #8b2252;">"age"</span>:6 }
my_pet[<span style="color: #8b2252;">"name"</span>]
<span style="color: #b22222;"># </span><span style="color: #b22222;">or if it was an object</span>
<span style="color: #a0522d;">my_pet</span> = Pet(<span style="color: #8b2252;">"Dan"</span>,<span style="color: #8b2252;">"dog"</span>,6)
my_pet.name
</pre>
</div>

<p>
(&amp;my<sub>pet</sub>)-&gt;name
my<sub>pet.name</sub>
</p>

<p>
In C with structs you use the dot operator to access fields or members
of the structs
</p>

<p>
names = { "Darren", "Dan" }
ages  = { 3       , 6 }
type  = {"cat",     "dog" }
          0           1
</p>

<p>
#define DARREN 0
names[DARREN]
ages[DARREN]
type[DARREN]
</p>

<p>
darren.name
darren.age
darren.type
</p>


<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">NAME_LEN</span> 17
<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">TYPE_LEN</span> 9

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #a020f0;">struct</span> { 
        <span style="color: #228b22;">int</span> <span style="color: #a0522d;">x</span>;
        <span style="color: #228b22;">int</span> <span style="color: #a0522d;">y</span>;
    } <span style="color: #a0522d;">foo</span>;
    <span style="color: #a020f0;">struct</span> { <span style="color: #b22222;">// </span><span style="color: #b22222;">declare a struct type</span>
        <span style="color: #228b22;">char</span> <span style="color: #a0522d;">name</span>[NAME_LEN];
        <span style="color: #228b22;">char</span> <span style="color: #a0522d;">type</span>[TYPE_LEN];
        <span style="color: #228b22;">double</span> <span style="color: #a0522d;">doub</span>;
        <span style="color: #228b22;">int</span>  <span style="color: #a0522d;">age</span>;
   } <span style="color: #a0522d;">my_pet</span>  = { <span style="color: #8b2252;">"Dan"</span>, <span style="color: #8b2252;">"dog"</span>, 5.0, 6 }, <span style="color: #b22222;">// </span><span style="color: #b22222;">name and initialize 1 instance of the struct</span>
     <span style="color: #a0522d;">my_pet2</span> = { <span style="color: #8b2252;">"Dan"</span>, <span style="color: #8b2252;">"dog"</span>, 5.0, 6 }; <span style="color: #b22222;">// </span><span style="color: #b22222;">name and initialize 1 instance of the struct</span>
   printf(<span style="color: #8b2252;">"%s, %s, %d\n"</span>, my_pet.name, my_pet.type, my_pet.age);
   printf(<span style="color: #8b2252;">"sizeof(my_pet)=%lu\n"</span>,<span style="color: #a020f0;">sizeof</span>(my_pet));
}
</pre>
</div>
</div>
</div>
