week06/presentation.tex


\subsubsection{Struct Intro}
\label{sec:org17b78ea}
How do you store a record?

In python you typically use a dictionary and store key value pairs
within a dictionary.

\begin{verbatim}
my_pet = {"name":"Dan", "type":"dog", "age":6 }
\end{verbatim}

In C structures allow you to group relevant information together such
that you can access fields (properties).

\begin{verbatim}
#define NAME_LEN 17
#define TYPE_LEN 9
struct {
    char name[NAME_LEN];
    char type[TYPE_LEN];
    int  age;
} my_pet;
\end{verbatim}

In python you access the dictionary or object with:
\begin{verbatim}
my_pet = {"name":"Dan", "type":"dog", "age":6 }
my_pet["name"]
# or if it was an object
my_pet = Pet("Dan","dog",6)
my_pet.name
\end{verbatim}

(\&my\(_{\text{pet}}\))->name
my\(_{\text{pet.name}}\)

In C with structs you use the dot operator to access fields or members
of the structs

names = \{ "Darren", "Dan" \}
ages  = \{ 3       , 6 \}
type  = \{"cat",     "dog" \}
          0           1

\#define DARREN 0
names[DARREN]
ages[DARREN]
type[DARREN]

darren.name
darren.age
darren.type


\begin{verbatim}
#include <stdio.h>
#define NAME_LEN 17
#define TYPE_LEN 9

int main() {
    struct { 
        int x;
        int y;
    } foo;
    struct { // declare a struct type
        char name[NAME_LEN];
        char type[TYPE_LEN];
        double doub;
        int  age;
   } my_pet  = { "Dan", "dog", 5.0, 6 }, // name and initialize 1 instance of the struct
     my_pet2 = { "Dan", "dog", 5.0, 6 }; // name and initialize 1 instance of the struct
   printf("%s, %s, %d\n", my_pet.name, my_pet.type, my_pet.age);
   printf("sizeof(my_pet)=%lu\n",sizeof(my_pet));
}
\end{verbatim}
