week06/presentation.html

<div id="outline-container-org9635326" class="outline-4">
<h4 id="org9635326"><span class="section-number-4">1.5.3</span> Structs in memory</h4>
<div class="outline-text-4" id="text-1-5-3">
<p>
Structs are very compact. They are all their field datatypes stacked
together.
</p>

<p>
It will be mixed datatypes in memory:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">name</th>
<th scope="col" class="org-right">offset</th>
<th scope="col" class="org-left">value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">name</td>
<td class="org-right">0</td>
<td class="org-left">"Dan\0"</td>
</tr>

<tr>
<td class="org-left">type</td>
<td class="org-right">17</td>
<td class="org-left">"dog\0"</td>
</tr>

<tr>
<td class="org-left">age</td>
<td class="org-right">26</td>
<td class="org-left">6</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">0</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right">4</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right">8</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right">12</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right">16</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right">20</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right">24</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right">26</th>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-right">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">'D'</td>
<td class="org-left">'a'</td>
<td class="org-left">'n'</td>
<td class="org-left">'\0'</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">'d'</td>
<td class="org-left">'o'</td>
<td class="org-left">'g'</td>
<td class="org-right">'\0'</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">00</td>
<td class="org-right">00</td>
<td class="org-right">00</td>
<td class="org-right">06</td>
</tr>
</tbody>
</table>


<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">NAME_LEN</span> 17
<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">TYPE_LEN</span> 9

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #a020f0;">struct</span> { <span style="color: #b22222;">// </span><span style="color: #b22222;">declare a struct type</span>
        <span style="color: #228b22;">char</span> <span style="color: #a0522d;">name</span>[NAME_LEN];
        <span style="color: #228b22;">char</span> <span style="color: #a0522d;">type</span>[TYPE_LEN];
        <span style="color: #228b22;">int</span>  <span style="color: #a0522d;">age</span>;
   } <span style="color: #a0522d;">my_pet</span> = { <span style="color: #8b2252;">"Dan"</span>, <span style="color: #8b2252;">"dog"</span>, 6 }; <span style="color: #b22222;">// </span><span style="color: #b22222;">name and initialize 1 instance of the struct</span>
   printf(<span style="color: #8b2252;">"%s, %s, %d\n"</span>, my_pet.name, my_pet.type, my_pet.age);
   printf(<span style="color: #8b2252;">"struct      location:\t %p\n"</span>, (<span style="color: #228b22;">void</span>*)&amp;my_pet);
   printf(<span style="color: #8b2252;">"my_pet.name location:\t %p\n"</span>, (<span style="color: #228b22;">void</span>*)&amp;my_pet.name);
   printf(<span style="color: #8b2252;">"my_pet.type location:\t %p\n"</span>, (<span style="color: #228b22;">void</span>*)&amp;my_pet.type);
   printf(<span style="color: #8b2252;">"my_pet.age  location:\t %p\n"</span>, (<span style="color: #228b22;">void</span>*)&amp;my_pet.age);
   printf(<span style="color: #8b2252;">"my_pet.name size:\t %lu\n"</span>, <span style="color: #a020f0;">sizeof</span>(my_pet.name));
   printf(<span style="color: #8b2252;">"my_pet.type size:\t %lu\n"</span>, <span style="color: #a020f0;">sizeof</span>(my_pet.type));
   printf(<span style="color: #8b2252;">"my_pet.age  size:\t %lu\n"</span>, <span style="color: #a020f0;">sizeof</span>(my_pet.age));
   printf(<span style="color: #8b2252;">"sizeof(my_pet)=%lu\n"</span>,<span style="color: #a020f0;">sizeof</span>(my_pet));

}
</pre>
</div>

<pre class="example">
Dan, dog, 6
struct      location:	 0x7ffddab4ee70
my_pet.name location:	 0x7ffddab4ee70
my_pet.type location:	 0x7ffddab4ee81
my_pet.age  location:	 0x7ffddab4ee8c
my_pet.name size:	 17
my_pet.type size:	 9
my_pet.age  size:	 4
sizeof(my_pet)=32

</pre>
</div>
</div>
