week06/presentation.tex

\subsubsection{Structs in memory}
\label{sec:orge315619}

Structs are very compact. They are all their field datatypes stacked
together.

It will be mixed datatypes in memory:

\begin{center}
\begin{tabular}{lrl}
name & offset & value\\
\hline
name & 0 & "Dan$\backslash$0"\\
type & 17 & "dog$\backslash$0"\\
age & 26 & 6\\
\end{tabular}
\end{center}

\begin{center}
\begin{tabular}{rlllrlllrlllrlllrlllrlllrlrrrr}
0 &  &  &  & 4 &  &  &  & 8 &  &  &  & 12 &  &  &  & 16 &  &  &  & 20 &  &  &  & 24 &  & 26 &  &  & \\
\hline
'D' & 'a' & 'n' & '$\backslash$0' &  &  &  &  &  &  &  &  &  &  &  &  &  & 'd' & 'o' & 'g' & '$\backslash$0' &  &  &  &  &  & 00 & 00 & 00 & 06\\
\end{tabular}
\end{center}


\begin{verbatim}
#include <stdio.h>
#define NAME_LEN 17
#define TYPE_LEN 9

int main() {
    struct { // declare a struct type
        char name[NAME_LEN];
        char type[TYPE_LEN];
        int  age;
   } my_pet = { "Dan", "dog", 6 }; // name and initialize 1 instance of the struct
   printf("%s, %s, %d\n", my_pet.name, my_pet.type, my_pet.age);
   printf("struct      location:\t %p\n", (void*)&my_pet);
   printf("my_pet.name location:\t %p\n", (void*)&my_pet.name);
   printf("my_pet.type location:\t %p\n", (void*)&my_pet.type);
   printf("my_pet.age  location:\t %p\n", (void*)&my_pet.age);
   printf("my_pet.name size:\t %lu\n", sizeof(my_pet.name));
   printf("my_pet.type size:\t %lu\n", sizeof(my_pet.type));
   printf("my_pet.age  size:\t %lu\n", sizeof(my_pet.age));
   printf("sizeof(my_pet)=%lu\n",sizeof(my_pet));

}
\end{verbatim}

\begin{verbatim}
Dan, dog, 6
struct      location:	 0x7ffcbdf3e0b0
my_pet.name location:	 0x7ffcbdf3e0b0
my_pet.type location:	 0x7ffcbdf3e0c1
my_pet.age  location:	 0x7ffcbdf3e0cc
my_pet.name size:	 17
my_pet.type size:	 9
my_pet.age  size:	 4
sizeof(my_pet)=32
\end{verbatim}
