week06/presentation.org
*** Structure Types

You can predeclare structure "tags" ahead of time so you can reuse your type.

#+BEGIN_SRC C 
#include <stdio.h>
#define NAME_LEN 17
#define TYPE_LEN 9

struct my_pet { // declare a struct type
    char name[NAME_LEN];
    char type[TYPE_LEN];
    int  age;
}; // REMEMBER THE SEMICOLON

int main() {
    struct my_pet my_pet1 = { "Dan", "dog", 6 }; // name and initialize 1 instance of the struct
    struct my_pet my_pet2 = { .name = "Darren", .type = "cat", .age = 3 }; // designated initializer
    printf("%s and %s get along just fine.\n", my_pet1.name, my_pet2.name);
}
#+END_SRC

#+RESULTS:
: Dan and Darren get along just fine.

**** Typedef instead of struct tag

You can also typedef it away but it causes issues later.

#+BEGIN_SRC C 
#include <stdio.h>
#define NAME_LEN 17
#define TYPE_LEN 9

typedef struct { // declare a struct type
    char name[NAME_LEN];
    char type[TYPE_LEN];
    int  age;
} MyPet; // REMEMBER THE SEMICOLON

int main() {
    MyPet my_pet1 = { "Dan", "dog", 6 }; // name and initialize 1 instance of the struct
    MyPet my_pet2 = { .name = "Darren", .type = "cat", .age = 3 }; // designated initializer
    printf("%s and %s get along just fine.\n", my_pet1.name, my_pet2.name);
}
#+END_SRC

#+RESULTS:
: Dan and Darren get along just fine.

**** Or combine both typedef and struct tags

#+BEGIN_SRC C 
#include <stdio.h>
#define NAME_LEN 17
#define TYPE_LEN 9

// First declare the struct tag
// struct my_pet
struct my_pet { // declare a struct type
    char name[NAME_LEN];
    char type[TYPE_LEN];
    int  age;
    struct my_pet * ptr;
}; // REMEMBER THE SEMICOLON

// Then typedef it

typedef struct my_pet MyPet;

int main() {
    MyPet my_pet1 = { "Dan", "dog", 6 }; // name and initialize 1 instance of the struct
    MyPet my_pet2 = { .name = "Darren", .type = "cat", .age = 3 }; // designated initializer
    printf("%s and %s get along just fine.\n", my_pet1.name, my_pet2.name);
}
#+END_SRC

#+RESULTS:
: Dan and Darren get along just fine.

