week06/presentation.html

<div id="outline-container-org647e6e7" class="outline-4">
<h4 id="org647e6e7"><span class="section-number-4">1.5.4</span> Initializing</h4>
<div class="outline-text-4" id="text-1-5-4">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">NAME_LEN</span> 17
<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">TYPE_LEN</span> 9

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #a020f0;">struct</span> { <span style="color: #b22222;">// </span><span style="color: #b22222;">declare a struct type</span>
        <span style="color: #228b22;">char</span> <span style="color: #a0522d;">name</span>[NAME_LEN];
        <span style="color: #228b22;">char</span> <span style="color: #a0522d;">type</span>[TYPE_LEN];
        <span style="color: #228b22;">int</span>  <span style="color: #a0522d;">age</span>;
   } <span style="color: #a0522d;">my_pet1</span> = { <span style="color: #8b2252;">"Dan"</span>, <span style="color: #8b2252;">"dog"</span>, 6 }, <span style="color: #b22222;">// </span><span style="color: #b22222;">name and initialize 1 instance of the struct</span>
     <span style="color: #a0522d;">my_pet2</span> = { .name = <span style="color: #8b2252;">"Darren"</span>, .type = <span style="color: #8b2252;">"cat"</span>, .age = 3 }; <span style="color: #b22222;">// </span><span style="color: #b22222;">designated initializer</span>
   printf(<span style="color: #8b2252;">"%s and %s get along just fine.\n"</span>, my_pet1.name, my_pet2.name);
}
</pre>
</div>

<pre class="example">
Dan and Darren get along just fine.

</pre>
</div>
</div>


<div id="outline-container-org0952526" class="outline-4">
<h4 id="org0952526"><span class="section-number-4">1.5.5</span> Structure Types</h4>
<div class="outline-text-4" id="text-1-5-5">
<p>
You can predeclare structure "tags" ahead of time so you can reuse your type.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">NAME_LEN</span> 17
<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">TYPE_LEN</span> 9

<span style="color: #a020f0;">struct</span> <span style="color: #228b22;">my_pet</span> { <span style="color: #b22222;">// </span><span style="color: #b22222;">declare a struct type</span>
    <span style="color: #228b22;">char</span> <span style="color: #a0522d;">name</span>[NAME_LEN];
    <span style="color: #228b22;">char</span> <span style="color: #a0522d;">type</span>[TYPE_LEN];
    <span style="color: #228b22;">int</span>  <span style="color: #a0522d;">age</span>;
}; <span style="color: #b22222;">// </span><span style="color: #b22222;">REMEMBER THE SEMICOLON</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">my_pet</span> <span style="color: #a0522d;">my_pet1</span> = { <span style="color: #8b2252;">"Dan"</span>, <span style="color: #8b2252;">"dog"</span>, 6 }; <span style="color: #b22222;">// </span><span style="color: #b22222;">name and initialize 1 instance of the struct</span>
    <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">my_pet</span> <span style="color: #a0522d;">my_pet2</span> = { .name = <span style="color: #8b2252;">"Darren"</span>, .type = <span style="color: #8b2252;">"cat"</span>, .age = 3 }; <span style="color: #b22222;">// </span><span style="color: #b22222;">designated initializer</span>
    printf(<span style="color: #8b2252;">"%s and %s get along just fine.\n"</span>, my_pet1.name, my_pet2.name);
}
</pre>
</div>

<pre class="example">
Dan and Darren get along just fine.

</pre>
</div>

<ol class="org-ol">
<li><a id="org278bad5"></a>Typedef instead of struct tag<br />
<div class="outline-text-5" id="text-1-5-5-1">
<p>
You can also typedef it away but it causes issues later.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">NAME_LEN</span> 17
<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">TYPE_LEN</span> 9

<span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">struct</span> { <span style="color: #b22222;">// </span><span style="color: #b22222;">declare a struct type</span>
    <span style="color: #228b22;">char</span> <span style="color: #a0522d;">name</span>[NAME_LEN];
    <span style="color: #228b22;">char</span> <span style="color: #a0522d;">type</span>[TYPE_LEN];
    <span style="color: #228b22;">int</span>  <span style="color: #a0522d;">age</span>;
} <span style="color: #228b22;">MyPet</span>; <span style="color: #b22222;">// </span><span style="color: #b22222;">REMEMBER THE SEMICOLON</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #228b22;">MyPet</span> <span style="color: #a0522d;">my_pet1</span> = { <span style="color: #8b2252;">"Dan"</span>, <span style="color: #8b2252;">"dog"</span>, 6 }; <span style="color: #b22222;">// </span><span style="color: #b22222;">name and initialize 1 instance of the struct</span>
    <span style="color: #228b22;">MyPet</span> <span style="color: #a0522d;">my_pet2</span> = { .name = <span style="color: #8b2252;">"Darren"</span>, .type = <span style="color: #8b2252;">"cat"</span>, .age = 3 }; <span style="color: #b22222;">// </span><span style="color: #b22222;">designated initializer</span>
    printf(<span style="color: #8b2252;">"%s and %s get along just fine.\n"</span>, my_pet1.name, my_pet2.name);
}
</pre>
</div>

<pre class="example">
Dan and Darren get along just fine.

</pre>
</div>
</li>

<li><a id="org9fca17e"></a>Or combine both typedef and struct tags<br />
<div class="outline-text-5" id="text-1-5-5-2">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">NAME_LEN</span> 17
<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">TYPE_LEN</span> 9

<span style="color: #b22222;">// </span><span style="color: #b22222;">First declare the struct tag</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">struct my_pet</span>
<span style="color: #a020f0;">struct</span> <span style="color: #228b22;">my_pet</span> { <span style="color: #b22222;">// </span><span style="color: #b22222;">declare a struct type</span>
    <span style="color: #228b22;">char</span> <span style="color: #a0522d;">name</span>[NAME_LEN];
    <span style="color: #228b22;">char</span> <span style="color: #a0522d;">type</span>[TYPE_LEN];
    <span style="color: #228b22;">int</span>  <span style="color: #a0522d;">age</span>;
    <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">my_pet</span> * <span style="color: #a0522d;">ptr</span>;
}; <span style="color: #b22222;">// </span><span style="color: #b22222;">REMEMBER THE SEMICOLON</span>

<span style="color: #b22222;">// </span><span style="color: #b22222;">Then typedef it</span>

<span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">my_pet</span> <span style="color: #228b22;">MyPet</span>;

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #228b22;">MyPet</span> <span style="color: #a0522d;">my_pet1</span> = { <span style="color: #8b2252;">"Dan"</span>, <span style="color: #8b2252;">"dog"</span>, 6 }; <span style="color: #b22222;">// </span><span style="color: #b22222;">name and initialize 1 instance of the struct</span>
    <span style="color: #228b22;">MyPet</span> <span style="color: #a0522d;">my_pet2</span> = { .name = <span style="color: #8b2252;">"Darren"</span>, .type = <span style="color: #8b2252;">"cat"</span>, .age = 3 }; <span style="color: #b22222;">// </span><span style="color: #b22222;">designated initializer</span>
    printf(<span style="color: #8b2252;">"%s and %s get along just fine.\n"</span>, my_pet1.name, my_pet2.name);
}
</pre>
</div>

<pre class="example">
Dan and Darren get along just fine.

</pre>
</div>
</li>
