week06/presentation.html

<li><a id="orga85cccf"></a>Hazel's example of typedef and style<br />
<div class="outline-text-5" id="text-1-5-5-3">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>

<span style="color: #b22222;">/* </span><span style="color: #b22222;">A common thing to do is to typedef a struct</span>
<span style="color: #b22222;"> * so that you don't have to type struct whatever</span>
<span style="color: #b22222;"> * so often.</span>
<span style="color: #b22222;"> </span><span style="color: #b22222;">*/</span>

<span style="color: #a020f0;">struct</span> <span style="color: #228b22;">coordinate</span> {
    <span style="color: #228b22;">float</span> <span style="color: #a0522d;">x</span>;
    <span style="color: #228b22;">float</span> <span style="color: #a0522d;">y</span>;
};

<span style="color: #b22222;">// </span><span style="color: #b22222;">We use a capital first letter to indicate a type</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">This is a newer style.</span>
<span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">coordinate</span> <span style="color: #228b22;">Coordinate</span>;
<span style="color: #b22222;">// </span><span style="color: #b22222;">Or we could use "_t" at the end.</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">This is an older style. Remember uint64_t?</span>
<span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">coordinate</span> <span style="color: #228b22;">coordinate_t</span>;

<span style="color: #228b22;">Coordinate</span> <span style="color: #0000ff;">move_left</span>(<span style="color: #228b22;">Coordinate</span> <span style="color: #a0522d;">position</span>) {
    position.x -= 1.0;
    <span style="color: #a020f0;">return</span> position;
}

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #228b22;">Coordinate</span> <span style="color: #a0522d;">position</span> = { 0, 0 };
    printf(<span style="color: #8b2252;">"position=(%g,%g)\n"</span>,
           position.x,
           position.y
    );
    <span style="color: #228b22;">Coordinate</span> <span style="color: #a0522d;">new_position</span> = move_left(position);
    printf(<span style="color: #8b2252;">"position=(%g,%g)\n"</span>,
           position.x,
           position.y
    );
    printf(<span style="color: #8b2252;">"new_position=(%g,%g)\n"</span>,
           new_position.x,
           new_position.y
    );
    position = move_left(move_left(position));
    printf(<span style="color: #8b2252;">"position=(%g,%g)\n"</span>,
           position.x,
           position.y
    );
}
</pre>
</div>

<pre class="example">
position=(0,0)
position=(0,0)
new_position=(-1,0)
position=(-2,0)

</pre>
</div>
</li>
