week06/presentation.org
**** Pass by Value Gotcha

#+BEGIN_SRC C
#include <stdio.h>
#include <string.h>

/* The important thing to notice here is that
 * structs are pass-by-value. Just like a single float,
 * when we pass a struct to a function it gets a COPY
 * of the original struct!
 * We can also assign structs and we get a COPY.
 * We can also return structs and we get a COPY.
 */

struct coordinate { // leaving behind for size comparison
    float x;
    float y;
};

struct named_coordinate {
    float x;
    float y;
    char * name; // WARNING this is a pointer!
};

struct named_coordinate move_left(struct named_coordinate position) {
    printf("I am moving position.name: %s [%p] LEFT\n", 
           position.name, 
           (void*)position.name);
    position.x -= 1.0;
    return position;
}

int main() {
    char * my_string_literal = "YoloStringLiteral!-X-X-X-X-X-X";
    printf("my_string_literal pointer is at %p\n", (void*)(&my_string_literal));
    struct named_coordinate position = { 0, 0, my_string_literal };
    printf("position=(%g,%g)\n",
           position.x,
           position.y
    );
    struct named_coordinate new_position = move_left(position);
    printf("position=(%g,%g)\n",
           position.x,
           position.y
    );
    printf("new_position=(%g,%g)\n",
           new_position.x,
           new_position.y
    );
    position = move_left(move_left(position));
    printf("position=(%g,%g)\n",
           position.x,
           position.y
    );
    // So we now have a string in our struct? How does it change the struct?
    printf("Size of named_coordinate: %lu\n",sizeof(new_position));
    printf("Size of coordinate: %lu\n",sizeof(struct coordinate));
    printf("Size of my_string_literal: %lu\n",sizeof(my_string_literal));
    printf("strlen of my_string_literal: %lu\n",strlen(my_string_literal));
    // COPY BY VALUE MEANS POINTERS ARE COPIED, but not their contents.
    printf("&position.name     %p\n",(void*)&position.name); // they have different pointers
    printf("&new_position.name %p\n", (void*)&new_position.name);  // they have different pointers
    printf("position.name      %p\n", (void*)position.name); // but they point to the same thing
    printf("new_position.name  %p\n", (void*)new_position.name); // but they point to the same thing
    printf("position.name      %s\n", position.name); // but they point to the same thing
    printf("new_position.name  %s\n", new_position.name); // but they point to the same thing

}
#+END_SRC

#+RESULTS:
#+begin_example
my_string_literal pointer is at 0x7ffc034aeb68
position=(0,0)
I am moving position.name: YoloStringLiteral!-X-X-X-X-X-X [0x5567c2ff4a98] LEFT
position=(0,0)
new_position=(-1,0)
I am moving position.name: YoloStringLiteral!-X-X-X-X-X-X [0x5567c2ff4a98] LEFT
I am moving position.name: YoloStringLiteral!-X-X-X-X-X-X [0x5567c2ff4a98] LEFT
position=(-2,0)
Size of named_coordinate: 16
Size of coordinate: 8
Size of my_string_literal: 8
strlen of my_string_literal: 30
&position.name     0x7ffc034aeb78
&new_position.name 0x7ffc034aeb88
position.name      0x5567c2ff4a98
new_position.name  0x5567c2ff4a98
position.name      YoloStringLiteral!-X-X-X-X-X-X
new_position.name  YoloStringLiteral!-X-X-X-X-X-X
#+end_example


