week06/presentation.html


<li><a id="orged998ad"></a>Pass by Value Gotcha<br />
<div class="outline-text-5" id="text-1-5-5-4">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;string.h&gt;</span>

<span style="color: #b22222;">/* </span><span style="color: #b22222;">The important thing to notice here is that</span>
<span style="color: #b22222;"> * structs are pass-by-value. Just like a single float,</span>
<span style="color: #b22222;"> * when we pass a struct to a function it gets a COPY</span>
<span style="color: #b22222;"> * of the original struct!</span>
<span style="color: #b22222;"> * We can also assign structs and we get a COPY.</span>
<span style="color: #b22222;"> * We can also return structs and we get a COPY.</span>
<span style="color: #b22222;"> </span><span style="color: #b22222;">*/</span>

<span style="color: #a020f0;">struct</span> <span style="color: #228b22;">coordinate</span> { <span style="color: #b22222;">// </span><span style="color: #b22222;">leaving behind for size comparison</span>
    <span style="color: #228b22;">float</span> <span style="color: #a0522d;">x</span>;
    <span style="color: #228b22;">float</span> <span style="color: #a0522d;">y</span>;
};

<span style="color: #a020f0;">struct</span> <span style="color: #228b22;">named_coordinate</span> {
    <span style="color: #228b22;">float</span> <span style="color: #a0522d;">x</span>;
    <span style="color: #228b22;">float</span> <span style="color: #a0522d;">y</span>;
    <span style="color: #228b22;">char</span> * <span style="color: #a0522d;">name</span>; <span style="color: #b22222;">// </span><span style="color: #b22222;">WARNING this is a pointer!</span>
};

<span style="color: #a020f0;">struct</span> <span style="color: #228b22;">named_coordinate</span> <span style="color: #0000ff;">move_left</span>(<span style="color: #a020f0;">struct</span> <span style="color: #228b22;">named_coordinate</span> <span style="color: #a0522d;">position</span>) {
    printf(<span style="color: #8b2252;">"I am moving position.name: %s [%p] LEFT\n"</span>, 
           position.name, 
           (<span style="color: #228b22;">void</span>*)position.name);
    position.x -= 1.0;
    <span style="color: #a020f0;">return</span> position;
}

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #228b22;">char</span> * <span style="color: #a0522d;">my_string_literal</span> = <span style="color: #8b2252;">"YoloStringLiteral!-X-X-X-X-X-X"</span>;
    printf(<span style="color: #8b2252;">"my_string_literal pointer is at %p\n"</span>, (<span style="color: #228b22;">void</span>*)(&amp;my_string_literal));
    <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">named_coordinate</span> <span style="color: #a0522d;">position</span> = { 0, 0, my_string_literal };
    printf(<span style="color: #8b2252;">"position=(%g,%g)\n"</span>,
           position.x,
           position.y
    );
    <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">named_coordinate</span> <span style="color: #a0522d;">new_position</span> = move_left(position);
    printf(<span style="color: #8b2252;">"position=(%g,%g)\n"</span>,
           position.x,
           position.y
    );
    printf(<span style="color: #8b2252;">"new_position=(%g,%g)\n"</span>,
           new_position.x,
           new_position.y
    );
    position = move_left(move_left(position));
    printf(<span style="color: #8b2252;">"position=(%g,%g)\n"</span>,
           position.x,
           position.y
    );
    <span style="color: #b22222;">// </span><span style="color: #b22222;">So we now have a string in our struct? How does it change the struct?</span>
    printf(<span style="color: #8b2252;">"Size of named_coordinate: %lu\n"</span>,<span style="color: #a020f0;">sizeof</span>(new_position));
    printf(<span style="color: #8b2252;">"Size of coordinate: %lu\n"</span>,<span style="color: #a020f0;">sizeof</span>(<span style="color: #a020f0;">struct</span> <span style="color: #228b22;">coordinate</span>));
    printf(<span style="color: #8b2252;">"Size of my_string_literal: %lu\n"</span>,<span style="color: #a020f0;">sizeof</span>(my_string_literal));
    printf(<span style="color: #8b2252;">"strlen of my_string_literal: %lu\n"</span>,strlen(my_string_literal));
    <span style="color: #b22222;">// </span><span style="color: #b22222;">COPY BY VALUE MEANS POINTERS ARE COPIED, but not their contents.</span>
    printf(<span style="color: #8b2252;">"&amp;position.name     %p\n"</span>,(<span style="color: #228b22;">void</span>*)&amp;position.name); <span style="color: #b22222;">// </span><span style="color: #b22222;">they have different pointers</span>
    printf(<span style="color: #8b2252;">"&amp;new_position.name %p\n"</span>, (<span style="color: #228b22;">void</span>*)&amp;new_position.name);  <span style="color: #b22222;">// </span><span style="color: #b22222;">they have different pointers</span>
    printf(<span style="color: #8b2252;">"position.name      %p\n"</span>, (<span style="color: #228b22;">void</span>*)position.name); <span style="color: #b22222;">// </span><span style="color: #b22222;">but they point to the same thing</span>
    printf(<span style="color: #8b2252;">"new_position.name  %p\n"</span>, (<span style="color: #228b22;">void</span>*)new_position.name); <span style="color: #b22222;">// </span><span style="color: #b22222;">but they point to the same thing</span>
    printf(<span style="color: #8b2252;">"position.name      %s\n"</span>, position.name); <span style="color: #b22222;">// </span><span style="color: #b22222;">but they point to the same thing</span>
    printf(<span style="color: #8b2252;">"new_position.name  %s\n"</span>, new_position.name); <span style="color: #b22222;">// </span><span style="color: #b22222;">but they point to the same thing</span>

}
</pre>
</div>

<pre class="example">
my_string_literal pointer is at 0x7ffe79be7ce8
position=(0,0)
I am moving position.name: YoloStringLiteral!-X-X-X-X-X-X [0x55b28f376a98] LEFT
position=(0,0)
new_position=(-1,0)
I am moving position.name: YoloStringLiteral!-X-X-X-X-X-X [0x55b28f376a98] LEFT
I am moving position.name: YoloStringLiteral!-X-X-X-X-X-X [0x55b28f376a98] LEFT
position=(-2,0)
Size of named_coordinate: 16
Size of coordinate: 8
Size of my_string_literal: 8
strlen of my_string_literal: 30
&amp;position.name     0x7ffe79be7cf8
&amp;new_position.name 0x7ffe79be7d08
position.name      0x55b28f376a98
new_position.name  0x55b28f376a98
position.name      YoloStringLiteral!-X-X-X-X-X-X
new_position.name  YoloStringLiteral!-X-X-X-X-X-X
</pre>
</div>
</li>
</ol>
</div>
