week06/presentation.html


<div id="outline-container-org62706ff" class="outline-4">
<h4 id="org62706ff"><span class="section-number-4">1.5.6</span> Pointers and Structs</h4>
<div class="outline-text-4" id="text-1-5-6">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>

<span style="color: #b22222;">/* </span><span style="color: #b22222;">Using pointers to structs is very common.</span>
<span style="color: #b22222;"> * </span>
<span style="color: #b22222;"> * Using typedef to define a type that is a pointer</span>
<span style="color: #b22222;"> * to a particular kind of struct is also very common</span>
<span style="color: #b22222;"> * to avoid having to write the pointer everywhere.</span>
<span style="color: #b22222;"> * </span>
<span style="color: #b22222;"> * This allows us to make a sort of </span>
<span style="color: #b22222;"> * object-like variable.</span>
<span style="color: #b22222;"> </span><span style="color: #b22222;">*/</span>

<span style="color: #a020f0;">struct</span> <span style="color: #228b22;">coordinate</span> {
    <span style="color: #228b22;">float</span> <span style="color: #a0522d;">x</span>;
    <span style="color: #228b22;">float</span> <span style="color: #a0522d;">y</span>;
};

<span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">coordinate</span> *<span style="color: #228b22;">Coordinate</span>;
<span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">coordinate</span> *<span style="color: #228b22;">coordinate_t</span>;

<span style="color: #b22222;">// </span><span style="color: #b22222;">When we have a pointer to a struct, we use</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">"-&gt;" instead of "." to talk about a field.</span>

<span style="color: #228b22;">void</span> <span style="color: #0000ff;">move_left</span>(<span style="color: #228b22;">Coordinate</span> <span style="color: #a0522d;">position</span>) {
    position-&gt;x -= 1.0;
}

<span style="color: #b22222;">// </span><span style="color: #b22222;">"ptr-&gt;field" is just shorthand for "(*ptr).field"</span>

<span style="color: #228b22;">void</span> <span style="color: #0000ff;">move_up</span>(<span style="color: #228b22;">Coordinate</span> <span style="color: #a0522d;">position</span>) {
    position-&gt;y -= 1.0;
}

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">coordinate</span> <span style="color: #a0522d;">position</span> = { 0, 0 };
    printf(<span style="color: #8b2252;">"position=(%g,%g)\n"</span>,
           position.x,
           position.y
    );
    move_left(&amp;position);
    move_up(&amp;position);
    printf(<span style="color: #8b2252;">"position=(%g,%g)\n"</span>,
           position.x,
           position.y
    );
}
</pre>
</div>

<pre class="example">
position=(0,0)
position=(-1,-1)

</pre>
</div>
</div>
