week06/presentation.html

<div id="outline-container-org413a5e5" class="outline-4">
<h4 id="org413a5e5"><span class="section-number-4">1.5.7</span> Elaborate Matrix Example</h4>
<div class="outline-text-4" id="text-1-5-7">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>

<span style="color: #b22222;">/* </span><span style="color: #b22222;">But we don't just want to avoid duplicate function</span>
<span style="color: #b22222;"> * parameters, we want to avoid duplicate code too!</span>
<span style="color: #b22222;"> * Noticing that our bounds checking code appears</span>
<span style="color: #b22222;"> * twice, let's refactor...</span>
<span style="color: #b22222;"> </span><span style="color: #b22222;">*/</span>

<span style="color: #a020f0;">struct</span> <span style="color: #228b22;">matrix</span> {
    <span style="color: #228b22;">int</span> *<span style="color: #a0522d;">elements</span>;
    <span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">rows</span>;
    <span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">cols</span>;
};

<span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">matrix</span> <span style="color: #228b22;">Matrix</span>;

<span style="color: #a020f0;">struct</span> <span style="color: #228b22;">matrix_element</span> {
    <span style="color: #228b22;">Matrix</span> <span style="color: #a0522d;">matrix</span>;
    <span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">row</span>;
    <span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">col</span>;
};

<span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">matrix_element</span> <span style="color: #228b22;">MatrixElement</span>;

<span style="color: #b22222;">/* </span><span style="color: #b22222;">We can add our own bounds-checking to C!</span>
<span style="color: #b22222;"> </span><span style="color: #b22222;">*/</span>

<span style="color: #228b22;">void</span> <span style="color: #0000ff;">bounds_check</span>(<span style="color: #228b22;">MatrixElement</span> <span style="color: #a0522d;">elt</span>) {
    <span style="color: #a020f0;">if</span> (elt.row &gt;= elt.matrix.rows) {
        printf(<span style="color: #8b2252;">"Error: row index out of bounds!\n"</span>);
        abort();
    }
    <span style="color: #a020f0;">if</span> (elt.col &gt;= elt.matrix.cols) {
        printf(<span style="color: #8b2252;">"Error: col index out of bounds!\n"</span>);
        abort();
    }
}

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">get_element</span>(<span style="color: #228b22;">MatrixElement</span> <span style="color: #a0522d;">elt</span>) {
    bounds_check(elt);
    <span style="color: #a020f0;">return</span> elt.matrix.elements[
        elt.row * elt.matrix.cols + elt.col
    ];
}

<span style="color: #228b22;">void</span> <span style="color: #0000ff;">set_element</span>(
    <span style="color: #228b22;">MatrixElement</span> <span style="color: #a0522d;">elt</span>,
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">value</span>
) {
    bounds_check(elt);
    elt.matrix.elements[
        elt.row * elt.matrix.cols + elt.col
    ] = value;
}

<span style="color: #228b22;">void</span> <span style="color: #0000ff;">init_matrix</span>(<span style="color: #228b22;">Matrix</span> <span style="color: #a0522d;">matrix</span>) {
    <span style="color: #b22222;">// </span><span style="color: #b22222;">Note we don't have to keep reallocating memory because </span>
    <span style="color: #b22222;">// </span><span style="color: #b22222;">structs are COPIED</span>
    <span style="color: #228b22;">MatrixElement</span> <span style="color: #a0522d;">elt</span> = {matrix, 0, 0};
    <span style="color: #a020f0;">for</span> (elt.row = 0; elt.row &lt; matrix.rows; elt.row++) {
        <span style="color: #a020f0;">for</span> (elt.col = 0; elt.col &lt; matrix.cols; elt.col++) {
            set_element(elt, 0);
        }
    }
}

<span style="color: #228b22;">void</span> <span style="color: #0000ff;">print_matrix</span>(<span style="color: #228b22;">Matrix</span> <span style="color: #a0522d;">matrix</span>) {
    <span style="color: #228b22;">MatrixElement</span> <span style="color: #a0522d;">elt</span> = {matrix, 0, 0};
    <span style="color: #a020f0;">for</span> (elt.row = 0; elt.row &lt; matrix.rows; elt.row++) {
        <span style="color: #a020f0;">for</span> (elt.col = 0; elt.col &lt; matrix.cols; elt.col++) {
            <span style="color: #228b22;">int</span> <span style="color: #a0522d;">value</span> = get_element(elt);
            printf(<span style="color: #8b2252;">"%d "</span>, value);
        }
        printf(<span style="color: #8b2252;">"\n"</span>);
    }
}

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">rows</span> = 3;
    <span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">cols</span> = 3;
    <span style="color: #b22222;">// </span><span style="color: #b22222;">we will use our init_matrix function to initialize insead of an</span>
    <span style="color: #b22222;">// </span><span style="color: #b22222;">initializer. That way we don't have know the size of</span>
    <span style="color: #b22222;">// </span><span style="color: #b22222;">matrix_memory at compile time.</span>
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">matrix_memory</span>[rows * cols];
    <span style="color: #228b22;">Matrix</span> <span style="color: #a0522d;">matrix</span> = { matrix_memory, rows, cols };
    init_matrix(matrix);
    print_matrix(matrix);
    printf(<span style="color: #8b2252;">"\n"</span>);
    <span style="color: #228b22;">MatrixElement</span> <span style="color: #a0522d;">elt</span> = {matrix, 1, 1};
    set_element(elt, 2);
    print_matrix(matrix);
}
</pre>
</div>

<pre class="example">
0 0 0 
0 0 0 
0 0 0 

0 0 0 
0 2 0 
0 0 0

</pre>
</div>
</div>
</div>

<div id="outline-container-org0903ecb" class="outline-3">
<h3 id="org0903ecb"><span class="section-number-3">1.6</span> Enum</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Enums are enumerations, which is just a convienant way to make symbols
that have different values of the same type. Enums allow us to read
and write values from files and inputs and extract their symbolic meaning.
</p>

<p>
Enums are fundamental to symbolic computation.
</p>

<p>
Enum work good for switch cases, if statements, for loops.
</p>

<p>
Enums are good for representing the type of something or a category.
</p>
</div>
