week06/presentation.html

<div id="outline-container-orgb53bdb3" class="outline-4">
<h4 id="orgb53bdb3"><span class="section-number-4">1.6.1</span> Enum Example</h4>
<div class="outline-text-4" id="text-1-6-1">
<p>
Enums are good for representing states, symbols, simple values, etc.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>

<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">N_DIRECTIONS</span> 4
<span style="color: #a020f0;">enum</span> <span style="color: #228b22;">direction</span> {
    <span style="color: #a0522d;">UP</span>, <span style="color: #a0522d;">DOWN</span>, <span style="color: #a0522d;">LEFT</span>, <span style="color: #a0522d;">RIGHT</span>
};
<span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">enum</span> <span style="color: #228b22;">direction</span> <span style="color: #228b22;">Direction</span>;

<span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span> * <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">direction_names</span>[N_DIRECTIONS] = {
    [UP] = <span style="color: #8b2252;">"Up"</span>,
    [LEFT] = <span style="color: #8b2252;">"Left"</span>,
    [DOWN] = <span style="color: #8b2252;">"Down"</span>,
    [RIGHT] = <span style="color: #8b2252;">"Right"</span>
};

<span style="color: #228b22;">Direction</span> <span style="color: #0000ff;">clockwise</span>(<span style="color: #228b22;">Direction</span> <span style="color: #a0522d;">direction</span>) {
    <span style="color: #a020f0;">switch</span> (direction) {
        <span style="color: #a020f0;">case</span> UP:
            <span style="color: #a020f0;">return</span> RIGHT;
        <span style="color: #a020f0;">case</span> RIGHT:
            <span style="color: #a020f0;">return</span> DOWN;
        <span style="color: #a020f0;">case</span> DOWN:
            <span style="color: #a020f0;">return</span> LEFT;
        <span style="color: #a020f0;">case</span> LEFT:
            <span style="color: #a020f0;">return</span> UP;
        <span style="color: #a020f0;">default</span>:
            abort();
    }
}

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #228b22;">Direction</span> <span style="color: #a0522d;">d</span> = UP;
    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span> = 0 ; i &lt; 10; i++) {
        d = clockwise(d);
        printf(<span style="color: #8b2252;">"%d %s\t[%d]\n"</span>, i, direction_names[d], d);
    }
}
</pre>
</div>

<pre class="example">
0 Right	[3]
1 Down	[1]
2 Left	[2]
3 Up	[0]
4 Right	[3]
5 Down	[1]
6 Left	[2]
7 Up	[0]
8 Right	[3]
9 Down	[1]
</pre>
</div>
</div>

<div id="outline-container-orga2355a9" class="outline-4">
<h4 id="orga2355a9"><span class="section-number-4">1.6.2</span> enum<sub>typedef.c</sub></h4>
<div class="outline-text-4" id="text-1-6-2">
<p>
Enums are annoying to type. Typing enum enumname all the time is repetitive.
Typedefs allow us to label enum types with 1 word.
</p>

<p>
Typedef this 
</p>

<p>
enum enumname { &#x2026; } ;
</p>

<p>
with:
</p>

<p>
typedef enum enunumae Enumename ;
</p>


<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>

<span style="color: #a020f0;">enum</span> <span style="color: #228b22;">flavor</span> {
    <span style="color: #a0522d;">VANILLA</span>,
    <span style="color: #a0522d;">CHOCOLATE</span>,
    <span style="color: #a0522d;">STRAWBERRY</span>,
};

<span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">enum</span> <span style="color: #228b22;">flavor</span> <span style="color: #228b22;">Flavor</span>;

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #228b22;">Flavor</span> <span style="color: #a0522d;">favourite</span> = VANILLA;
    printf(<span style="color: #8b2252;">"favourite=%d\n"</span>, favourite);
    printf(<span style="color: #8b2252;">"sizeof(favourite)=%zu\n"</span>,
           <span style="color: #a020f0;">sizeof</span>(favourite));

    <span style="color: #a020f0;">switch</span> (favourite) {
        <span style="color: #a020f0;">case</span> VANILLA:
            printf(<span style="color: #8b2252;">"favourite=VANILLA\n"</span>);
            <span style="color: #a020f0;">break</span>;
        <span style="color: #a020f0;">case</span> CHOCOLATE:
            printf(<span style="color: #8b2252;">"favourite=CHOCOLATE\n"</span>);
            <span style="color: #a020f0;">break</span>;
        <span style="color: #a020f0;">case</span> STRAWBERRY:
            printf(<span style="color: #8b2252;">"favourite=STRAWBERRY\n"</span>);
            <span style="color: #a020f0;">break</span>;
        <span style="color: #a020f0;">default</span>:
            abort();
    }
}
</pre>
</div>

<pre class="example">
favourite=0
sizeof(favourite)=4
favourite=VANILLA

</pre>
</div>
</div>
