week06/presentation.html



<div id="outline-container-org001d19a" class="outline-4">
<h4 id="org001d19a"><span class="section-number-4">1.6.3</span> EnumStart</h4>
<div class="outline-text-4" id="text-1-6-3">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>

<span style="color: #a020f0;">enum</span> <span style="color: #228b22;">flavor</span> {
    <span style="color: #a0522d;">VANILLA</span> = 100,
    <span style="color: #a0522d;">CHOCOLATE</span>,
    <span style="color: #a0522d;">STRAWBERRY</span>,
};

<span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">enum</span> <span style="color: #228b22;">flavor</span> <span style="color: #228b22;">Flavor</span>;

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    printf(<span style="color: #8b2252;">"VANILLA=%d\n"</span>, VANILLA);
    printf(<span style="color: #8b2252;">"CHOCOLATE=%d\n"</span>, CHOCOLATE);
    printf(<span style="color: #8b2252;">"STRAWBERRY=%d\n"</span>, STRAWBERRY);
    printf(<span style="color: #8b2252;">"sizeof(Flavor)=%zu\n"</span>,
           <span style="color: #a020f0;">sizeof</span>(Flavor));
}
</pre>
</div>

<pre class="example">
VANILLA=100
CHOCOLATE=101
STRAWBERRY=102
sizeof(Flavor)=4

</pre>
</div>
</div>

<div id="outline-container-org86e90ee" class="outline-4">
<h4 id="org86e90ee"><span class="section-number-4">1.6.4</span> Enumassign</h4>
<div class="outline-text-4" id="text-1-6-4">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>

<span style="color: #a020f0;">enum</span> <span style="color: #228b22;">flavor</span> {
    <span style="color: #a0522d;">VANILLA</span> = 100,
    <span style="color: #a0522d;">CHOCOLATE</span> = 200,
    <span style="color: #a0522d;">STRAWBERRY</span> = 300,
};

<span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">enum</span> <span style="color: #228b22;">flavor</span> <span style="color: #228b22;">Flavor</span>;

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    printf(<span style="color: #8b2252;">"VANILLA=%d\n"</span>, VANILLA);
    printf(<span style="color: #8b2252;">"CHOCOLATE=%d\n"</span>, CHOCOLATE);
    printf(<span style="color: #8b2252;">"STRAWBERRY=%d\n"</span>, STRAWBERRY);
    printf(<span style="color: #8b2252;">"sizeof(Flavor)=%zu\n"</span>,
           <span style="color: #a020f0;">sizeof</span>(Flavor));
}
</pre>
</div>

<pre class="example">
VANILLA=100
CHOCOLATE=200
STRAWBERRY=300
sizeof(Flavor)=4

</pre>
</div>
</div>

<div id="outline-container-org70bdbae" class="outline-4">
<h4 id="org70bdbae"><span class="section-number-4">1.6.5</span> Enum<sub>loop</sub><sub>trick.c</sub></h4>
<div class="outline-text-4" id="text-1-6-5">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>

<span style="color: #b22222;">// </span><span style="color: #b22222;">this only works as long as we don't provide our</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">own values!</span>

<span style="color: #a020f0;">enum</span> <span style="color: #228b22;">flavor</span> {
    <span style="color: #a0522d;">VANILLA</span>,
    <span style="color: #a0522d;">CHOCOLATE</span>,
    <span style="color: #a0522d;">STRAWBERRY</span>,
    <span style="color: #a0522d;">N_FLAVORS</span> <span style="color: #b22222;">// </span><span style="color: #b22222;">Get the free max enum here</span>
};

<span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">enum</span> <span style="color: #228b22;">flavor</span> <span style="color: #228b22;">Flavor</span>;

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    printf(<span style="color: #8b2252;">"VANILLA=%d\n"</span>, VANILLA);
    printf(<span style="color: #8b2252;">"CHOCOLATE=%d\n"</span>, CHOCOLATE);
    printf(<span style="color: #8b2252;">"STRAWBERRY=%d\n"</span>, STRAWBERRY);
    printf(<span style="color: #8b2252;">"N_FLAVORS=%d\n"</span>, N_FLAVORS);
    printf(<span style="color: #8b2252;">"sizeof(Flavor)=%zu\n"</span>,
           <span style="color: #a020f0;">sizeof</span>(Flavor));

    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">Flavor</span> <span style="color: #a0522d;">flavor</span> = 0; flavor &lt; N_FLAVORS; flavor++) {
        <span style="color: #a020f0;">switch</span> (flavor) {
            <span style="color: #a020f0;">case</span> VANILLA:
                printf(<span style="color: #8b2252;">"flavor=VANILLA\n"</span>);
                <span style="color: #a020f0;">break</span>;
            <span style="color: #a020f0;">case</span> CHOCOLATE:
                printf(<span style="color: #8b2252;">"flavor=CHOCOLATE\n"</span>);
                <span style="color: #a020f0;">break</span>;
            <span style="color: #a020f0;">case</span> STRAWBERRY:
                printf(<span style="color: #8b2252;">"flavor=STRAWBERRY\n"</span>);
                <span style="color: #a020f0;">break</span>;
            <span style="color: #a020f0;">default</span>:
                abort();
        }
    }
}
</pre>
</div>

<pre class="example">
VANILLA=0
CHOCOLATE=1
STRAWBERRY=2
N_FLAVORS=3
sizeof(Flavor)=4
flavor=VANILLA
flavor=CHOCOLATE
flavor=STRAWBERRY

</pre>
</div>
</div>
