week06/presentation.tex



\subsubsection{EnumStart}
\label{sec:org90c2f99}

\begin{verbatim}
#include <stdio.h>
#include <stdlib.h>

enum flavor {
    VANILLA = 100,
    CHOCOLATE,
    STRAWBERRY,
};

typedef enum flavor Flavor;

int main() {
    printf("VANILLA=%d\n", VANILLA);
    printf("CHOCOLATE=%d\n", CHOCOLATE);
    printf("STRAWBERRY=%d\n", STRAWBERRY);
    printf("sizeof(Flavor)=%zu\n",
           sizeof(Flavor));
}
\end{verbatim}

\begin{verbatim}
VANILLA=100
CHOCOLATE=101
STRAWBERRY=102
sizeof(Flavor)=4
\end{verbatim}

\subsubsection{Enumassign}
\label{sec:orgaf42ecd}

\begin{verbatim}
#include <stdio.h>
#include <stdlib.h>

enum flavor {
    VANILLA = 100,
    CHOCOLATE = 200,
    STRAWBERRY = 300,
};

typedef enum flavor Flavor;

int main() {
    printf("VANILLA=%d\n", VANILLA);
    printf("CHOCOLATE=%d\n", CHOCOLATE);
    printf("STRAWBERRY=%d\n", STRAWBERRY);
    printf("sizeof(Flavor)=%zu\n",
           sizeof(Flavor));
}
\end{verbatim}

\begin{verbatim}
VANILLA=100
CHOCOLATE=200
STRAWBERRY=300
sizeof(Flavor)=4
\end{verbatim}

\subsubsection{Enum\(_{\text{loop}}\)\(_{\text{trick.c}}\)}
\label{sec:org8cc79ec}

\begin{verbatim}
#include <stdio.h>
#include <stdlib.h>

// this only works as long as we don't provide our
// own values!

enum flavor {
    VANILLA,
    CHOCOLATE,
    STRAWBERRY,
    N_FLAVORS // Get the free max enum here
};

typedef enum flavor Flavor;

int main() {
    printf("VANILLA=%d\n", VANILLA);
    printf("CHOCOLATE=%d\n", CHOCOLATE);
    printf("STRAWBERRY=%d\n", STRAWBERRY);
    printf("N_FLAVORS=%d\n", N_FLAVORS);
    printf("sizeof(Flavor)=%zu\n",
           sizeof(Flavor));

    for (Flavor flavor = 0; flavor < N_FLAVORS; flavor++) {
        switch (flavor) {
            case VANILLA:
                printf("flavor=VANILLA\n");
                break;
            case CHOCOLATE:
                printf("flavor=CHOCOLATE\n");
                break;
            case STRAWBERRY:
                printf("flavor=STRAWBERRY\n");
                break;
            default:
                abort();
        }
    }
}
\end{verbatim}

\begin{verbatim}
VANILLA=0
CHOCOLATE=1
STRAWBERRY=2
N_FLAVORS=3
sizeof(Flavor)=4
flavor=VANILLA
flavor=CHOCOLATE
flavor=STRAWBERRY
\end{verbatim}
