week06/presentation.html

<div id="outline-container-org6ff2edc" class="outline-4">
<h4 id="org6ff2edc"><span class="section-number-4">1.6.6</span> Enum Int</h4>
<div class="outline-text-4" id="text-1-6-6">
<p>
This is a fun trick to set a maximum value for your enum by using
another symbol
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>

<span style="color: #a020f0;">enum</span> <span style="color: #228b22;">flavor</span> {
    <span style="color: #a0522d;">VANILLA</span>,
    <span style="color: #a0522d;">CHOCOLATE</span>,
    <span style="color: #a0522d;">STRAWBERRY</span>,
    <span style="color: #a0522d;">N_FLAVORS</span> <span style="color: #b22222;">// </span><span style="color: #b22222;">LOOK MA! No Defines! Cute trick, might surprise people.</span>
};

<span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">enum</span> <span style="color: #228b22;">flavor</span> <span style="color: #228b22;">Flavor</span>;

<span style="color: #b22222;">// </span><span style="color: #b22222;">Here we use the fact that enums are really just ints!</span>
<span style="color: #228b22;">Flavor</span> <span style="color: #0000ff;">random_flavor</span>() {
    <span style="color: #a020f0;">return</span> (rand() % N_FLAVORS);
}

<span style="color: #228b22;">void</span> <span style="color: #0000ff;">check_flavor</span>(<span style="color: #228b22;">Flavor</span> <span style="color: #a0522d;">flavor</span>) {
    <span style="color: #a020f0;">if</span> (flavor &gt;= N_FLAVORS) {
        abort();
    }
    <span style="color: #b22222;">// </span><span style="color: #b22222;">Since a flavor is just an int, it could be negative...</span>
    <span style="color: #a020f0;">if</span> (flavor &lt; 0) {
        abort();
    }
}

<span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span> * <span style="color: #0000ff;">get_flavor_name</span>(<span style="color: #228b22;">Flavor</span> <span style="color: #a0522d;">flavor</span>) {
    check_flavor(flavor);
    <span style="color: #b22222;">// </span><span style="color: #b22222;">Here we use "Designated Initializers"!</span>
    <span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span> * <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">flavor_names</span>[N_FLAVORS] = {
        [CHOCOLATE] = <span style="color: #8b2252;">"Hamburger flavor"</span>,
        [VANILLA] = <span style="color: #8b2252;">"Raspberry"</span>,
        [STRAWBERRY] = <span style="color: #8b2252;">"Those packets that come in the ramen"</span>
    };
    <span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span> * <span style="color: #a0522d;">flavor_name</span> = flavor_names[flavor];
<span style="color: #b22222;">//     </span><span style="color: #b22222;">if (flavor_name == NULL) {</span>
<span style="color: #b22222;">//         </span><span style="color: #b22222;">printf("Flavor not found!\n");</span>
<span style="color: #b22222;">//         </span><span style="color: #b22222;">abort();</span>
<span style="color: #b22222;">//     </span><span style="color: #b22222;">}</span>
    <span style="color: #a020f0;">return</span> flavor_name;
}



<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    srand(time(<span style="color: #008b8b;">NULL</span>));
    <span style="color: #228b22;">Flavor</span> <span style="color: #a0522d;">flavor</span> = random_flavor();
    printf(
        <span style="color: #8b2252;">"flavor %d = %s\n"</span>,
        flavor,
        get_flavor_name(flavor)
    );
}
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Abram Hindle</p>
<p class="date">Created: 2020-03-10 Tue 10:09</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
